живЄт(зебра, земл€).
живЄт(собака, земл€).
живЄт(карп, вода).
живЄт(кит, вода).
живЄт(кошка, ’):-живЄт(собака, ’).
живЄт(крокодил, вода).
живЄт(крокодил, земл€).
живЄт(л€гушка, вода).
живЄт(л€гушка, земл€).
живЄт(утка, вода).
живЄт(утка, земл€).
живЄт(утка, воздух).
живЄт(орЄл, воздух).
живЄт(орЄл, земл€).
живЄт(буревестник, вода).
живЄт(буревестник, воздух).
живЄт_только_в_одной( то):-
	живЄт( то, воздух), not(живЄт( то, земл€)), not(живЄт( то, вода));
	живЄт( то, земл€), not(живЄт( то, воздух)), not(живЄт( то, вода));
	живЄт( то, вода), not(живЄт( то, земл€)), not(живЄт( то, воздух)).

живЄт_хот€_бы_в_двух( то):-
	живЄт( то, земл€), живЄт( то, вода);
	живЄт( то, земл€), живЄт( то, воздух);
	живЄт( то, вода), живЄт( то, воздух).

живЄт_ровно_в_двух( то):-
	живЄт( то, земл€), живЄт( то, вода), not(живЄт( то, воздух));
	живЄт( то, земл€), живЄт( то, воздух), not(живЄт( то, вода));
	живЄт( то, вода), живЄт( то, воздух), not(живЄт( то, земл€));
	живЄт( то, вода), живЄт( то, земл€), not(живЄт( то, воздух));
	живЄт( то, воздух), живЄт( то, вода), not(живЄт( то, земл€));
	живЄт( то, воздух), живЄт( то, земл€), not(живЄт( то, вода)).






